[
    {
        "question_id": "275",
        "catalog_id": "10",
        "question_text": "What does this sign mean?",
        "option_a": "Only ascending traffic ahead.",
        "option_b": "Steep ascent ahead.",
        "option_c": "Steep descent ahead.",
        "option_d": "Humpback bridge ahead.",
        "correct_answer": "B",
        "explanation": "This sign gives advance warning of a steep ascent/upward hill ahead. You should react by selecting the appropriate gear.",
        "image_name": "ABMW0077U19.png"
    },
    {
        "question_id": "362",
        "catalog_id": "10",
        "question_text": "What does this Garda signal mean?",
        "option_a": "Turn left.",
        "option_b": "Proceed if approaching from the front.",
        "option_c": "Stop if approaching from either the front or behind.",
        "option_d": "Turn right.",
        "correct_answer": "C",
        "explanation": "When approaching a Garda giving this signal you must stop.",
        "image_name": "ABMW0154R.jpg"
    },
    {
        "question_id": "399",
        "catalog_id": "10",
        "question_text": "What does this sign mean?",
        "option_a": "No bridges ahead.",
        "option_b": "End of overhead bridge area.",
        "option_c": "End of motorway.",
        "option_d": "No overtaking.",
        "correct_answer": "C",
        "explanation": "This sign indicates the end of the motorway. You are leaving the motorway and its rules will no longer apply.",
        "image_name": "ABMW0111RU19.png"
    },
    {
        "question_id": "285",
        "catalog_id": "10",
        "question_text": "What does this sign mean?",
        "option_a": "Double-decker buses only.",
        "option_b": "Contra-flow bus lane.",
        "option_c": "Two-way traffic system.",
        "option_d": "With-flow bus lane.",
        "correct_answer": "B",
        "explanation": "This sign tells you that you must drive on the left and not use the contra-flow bus lane day or night. A contra-flow bus lane is one where the buses are going in the opposite direction.",
        "image_name": "ABMW0046U19.png"
    },
    {
        "question_id": "20",
        "catalog_id": "1",
        "question_text": "Which vehicle is in the correct position to make a right turn from a minor road onto a major road?",
        "option_a": "1",
        "option_b": "4",
        "option_c": "3",
        "option_d": "2",
        "correct_answer": "A",
        "explanation": "The correct position from which to turn right from a minor road to a major road is just left of centre of the road. You should take up the correct position in good time and complete the turn by entering the left-hand side of the major road.",
        "image_name": "ABMW0312R.png"
    },
    {
        "question_id": "74",
        "catalog_id": "1",
        "question_text": "What action should the driver take?",
        "option_a": "Stop at the Stop line.",
        "option_b": "Signal the bus to proceed.",
        "option_c": "Proceed in front of the cyclist.",
        "option_d": "Proceed in front of the bus.",
        "correct_answer": "A",
        "explanation": "By law you must stop at a Stop line (or at a Stop sign if there is no Stop line), and wait for other traffic to clear before proceeding.",
        "image_name": "ABMW0254R.jpg"
    },
    {
        "question_id": "286",
        "catalog_id": "10",
        "question_text": "Unless otherwise indicated, what is the maximum permissible speed of a car towing a trailer on national roads?",
        "option_a": "120 km/h.",
        "option_b": "100 km/h.",
        "option_c": "80 km/h.",
        "option_d": "60 km/h.",
        "correct_answer": "C",
        "explanation": "When towing a trailer on a national road, it is illegal to exceed 80 km/h - exceeding this speed will make the vehicle unstable.",
        "image_name": "loader.gif"
    },
    {
        "question_id": "1",
        "catalog_id": "1",
        "question_text": "Why might it be dangerous to drive on a poorly-lit street?",
        "option_a": "Drivers can only see the traffic in front of them.",
        "option_b": "Pedestrians crossing in a dark area might be difficult to see.",
        "option_c": "Drivers can only see the traffic coming against them.",
        "option_d": "Traffic lights will not be working.",
        "correct_answer": "B",
        "explanation": "When you are driving along a poorly-lit street, you should take extra care - vulnerable road users such as pedestrians might not be so easy to see. You should always be prepared to react to a change in the traffic situation.",
        "image_name": "ABMW0262RU19.jpg"
    },
    {
        "question_id": "2",
        "catalog_id": "1",
        "question_text": "What should a driver be conscious of in this situation?",
        "option_a": "People crossing the street at the rear of the bus.",
        "option_b": "The bus may start to reverse.",
        "option_c": "Traffic emerging from the street on the left.",
        "option_d": "The bus driver will always signal before moving off.",
        "correct_answer": "A",
        "explanation": "You should always read the road ahead and be prepared to react to the changing traffic situation. In particular, you should be aware that pedestrians might emerge at the rear of the bus. In this situation you should also look out for pedestrians making their way towards the waiting Bus",
        "image_name": "ABMW0236R.jpg"
    },
    {
        "question_id": "3",
        "catalog_id": "1",
        "question_text": "There are pedestrians on the footpath ahead and there are pools of water on the road. What should a driver do?",
        "option_a": "Reduce speed and try to avoid the pools of water so as not to splash the pedestrians.",
        "option_b": "Sound the horn as a warning to the pedestrians and continue on.",
        "option_c": "Brake suddenly as you approach the pools of water.",
        "option_d": "Flash the headlights as a warning to the pedestrians.",
        "correct_answer": "A",
        "explanation": "During wet conditions, you should be aware that surface water can affect the stability of your vehicle. This is particularly so where the water lies in pools. As you drive through surface water, you should show consideration to pedestrians and cyclists and try not to splash them as you pass.",
        "image_name": "loader.gif"
    },
    {
        "question_id": "4",
        "catalog_id": "1",
        "question_text": "What should the driver do in this situation?",
        "option_a": "The driver must stop and allow all other traffic to proceed.",
        "option_b": "The driver must allow the blue car to proceed.",
        "option_c": "The driver may turn in front of the other two cars.",
        "option_d": "The driver must allow the red car to proceed.",
        "correct_answer": "C",
        "explanation": "When you are turning right from a major road to a minor road, you must yield to oncoming traffic and only proceed when it is safe to do so. However, the drivers on the minor roads must give way to the traffic on the major road.",
        "image_name": "ABMW0230R.jpg"
    },
    {
        "question_id": "18",
        "catalog_id": "1",
        "question_text": "What should a driver who wants to turn right do in this situation?",
        "option_a": "Proceed straight ahead or turn left.",
        "option_b": "Turn right from the left lane.",
        "option_c": "Reverse and get into the right lane.",
        "option_d": "Proceed straight ahead and take a wide turn to the right.",
        "correct_answer": "A",
        "explanation": "As you approach a junction where you want to turn right, you should read the road ahead and take up the correct position for turning in good time.",
        "image_name": "ABMW0306RU19.jpg"
    },
    {
        "question_id": "5",
        "catalog_id": "1",
        "question_text": "After a heavy downpour, why should a driver keep a greater distance from the vehicle in front?",
        "option_a": "Because required stopping distances are decreased.",
        "option_b": "Because wheels rotate at a greater speed after rain.",
        "option_c": "Because wheel-spray may impair visibility.",
        "option_d": "Because wheels rotate at a slower speed after rain.",
        "correct_answer": "C",
        "explanation": "Heavy rain can affect how well you can see and how well you can be seen by other road users. Because of that you should slow down in heavy rain and keep a greater distance from the vehicle in front.",
        "image_name": "ABMW0286RU19.jpg"
    },
    {
        "question_id": "6",
        "catalog_id": "1",
        "question_text": "Why is tailgating (driving too close behind the vehicle in front) dangerous?",
        "option_a": "The vehicle will exceed the speed limit.",
        "option_b": "The engine may overheat because of restricted air flow over the vehicle's engine.",
        "option_c": "The vehicle will not have sufficient distance to stop safely in an emergency.",
        "option_d": "The braking system is less efficient in the slipstream of the vehicle in front.",
        "correct_answer": "C",
        "explanation": "If you drive too close to the vehicle in front and it brakes suddenly, you will not have enough time to react. For that reason you should always keep a safe distance from the vehicle in front. One way of calculating a safe distance in dry weather is the two-second rule: allow at least two seconds to elapse between the vehicle in front and your own vehicle passing a fixed point such as a lamp post or sign post.",
        "image_name": "loader.gif"
    },
    {
        "question_id": "7",
        "catalog_id": "1",
        "question_text": "When a driver is driving behind another vehicle that they do not intend to overtake, what should the driver do?",
        "option_a": "Signal to following traffic to overtake both vehicles.",
        "option_b": "Keep well back to allow following traffic to overtake.",
        "option_c": "Keep well back and to the centre of the road.",
        "option_d": "Drive close behind it in order to let following traffic overtake both vehicles.",
        "correct_answer": "B",
        "explanation": "You should always allow sufficient distance between your vehicle and the vehicle in front. This will enable you to stop safely (within the distance you can see clear). It will also give overtaking vehicles enough room to pull in safely to the left lane after they have passed you.",
        "image_name": "loader.gif"
    }]